# 1. Вычислить число пи c заданной точностью *d*
#     *Пример:*
#     - при $d = 0.001, π = 3.141.$    $10^{-1} ≤ d ≤10^{-10}$


import math

d = int(input('Введите желаемую точность числа Пи: '))

# Формула Бэйли-Боруэйна-Плаффа

my_pi =\
    sum(1 / 16 ** i * (4 / (8 * i + 1) - 2/(8 * i + 4) - \
        1/(8 * i + 5) - 1/(8 * i + 6)) for i in range(d))

# Формула Лейбница

my_pi_ = 4 * (sum(1 / i for i in range(1, d + 1, 4)) + sum(-1 / i for i in range(3, d + 1, 4)))

print(f'По формуле Бэйли-Боруэйна-Плаффа:\t {my_pi}')
print(f'По формуле Лейбница:\t\t\t {my_pi_}  адекватна только при высокой точности?')
print('Математическая константа:\t\t', math.pi)
print('результат от 22/7:\t\t\t', 22 / 7)
